day=["первое","второе","третье","четвертое","пятое","шестое","седьмое", "восьмое", "девятое", "десятое", "одинадцатое",
     "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое","семнадцатое","восемнадцатое","девятнадцатое","двадцатое",
     "двадцать первое", "двадцать второе", "двадцать третье", "двадцать четвертое","двадцать пятое", "двадцать шестое", "двадцать седьмое",
     "двадцать восьмое","двадцать девятое", "тридцатое", "тридцатьь первое"]

month=["января","февраля","марта","апреля","мая","июня","июля","августа", "сентября", "октября", "ноября", "декабря"]

dd,mm,yyyy = input("введите дату: ").split(".")

# не проверяем корректность даты

print(f"{day[int(dd)-1]} {month[int(mm)-1]} {yyyy} года")

